In [1]:
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd
dt = pd.read_csv("data.csv")
dt

   Student ID Student Name  CGPA   Age Semester  Gender
0         111            A  3.22  18.0      F22    male
1         222            B   NaN  20.0      S22  female
2         333            C  3.62   NaN      F23  female
3         444            D  4.00  20.0      F23    male
4         555            E  3.68  21.0      S23    male
5         666            F  3.89  22.0      S23    male
6         777            O  3.91  30.0      F23   other

In [2]:
dt.shape

(7, 6)

In [3]:
dt.isnull()

   Student ID  Student Name   CGPA    Age  Semester  Gender
0       False         False  False  False     False   False
1       False         False   True  False     False   False
2       False         False  False   True     False   False
3       False         False  False  False     False   False
4       False         False  False  False     False   False
5       False         False  False  False     False   False
6       False         False  False  False     False   False

In [4]:
Full_fill_data =dt.fillna(0)
Full_fill_data

   Student ID Student Name  CGPA   Age Semester  Gender
0         111            A  3.22  18.0      F22    male
1         222            B  0.00  20.0      S22  female
2         333            C  3.62   0.0      F23  female
3         444            D  4.00  20.0      F23    male
4         555            E  3.68  21.0      S23    male
5         666            F  3.89  22.0      S23    male
6         777            O  3.91  30.0      F23   other

In [5]:
Full_fill_data.describe()

       Student ID      CGPA        Age
count    7.000000  7.000000   7.000000
mean   444.000000  3.188571  18.714286
std    239.787406  1.429830   9.105205
min    111.000000  0.000000   0.000000
25%    277.500000  3.420000  19.000000
50%    444.000000  3.680000  20.000000
75%    610.500000  3.900000  21.500000
max    777.000000  4.000000  30.000000

In [6]:
delete_data =dt.dropna(inplace=False)
delete_data

   Student ID Student Name  CGPA   Age Semester Gender
0         111            A  3.22  18.0      F22   male
3         444            D  4.00  20.0      F23   male
4         555            E  3.68  21.0      S23   male
5         666            F  3.89  22.0      S23   male
6         777            O  3.91  30.0      F23  other

In [7]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder() 
dt['Gender']= le.fit_transform(dt['Gender']) 
dt

   Student ID Student Name  CGPA   Age Semester  Gender
0         111            A  3.22  18.0      F22       1
1         222            B   NaN  20.0      S22       0
2         333            C  3.62   NaN      F23       0
3         444            D  4.00  20.0      F23       1
4         555            E  3.68  21.0      S23       1
5         666            F  3.89  22.0      S23       1
6         777            O  3.91  30.0      F23       2

In [8]:
Delete_data=dt.dropna(inplace=False)
Delete_data

   Student ID Student Name  CGPA   Age Semester  Gender
0         111            A  3.22  18.0      F22       1
3         444            D  4.00  20.0      F23       1
4         555            E  3.68  21.0      S23       1
5         666            F  3.89  22.0      S23       1
6         777            O  3.91  30.0      F23       2

In [9]:
dt1 = pd.get_dummies(dt, columns=['Gender'])
dt1

   Student ID Student Name  CGPA   Age Semester  Gender_0  Gender_1  Gender_2
0         111            A  3.22  18.0      F22     False      True     False
1         222            B   NaN  20.0      S22      True     False     False
2         333            C  3.62   NaN      F23      True     False     False
3         444            D  4.00  20.0      F23     False      True     False
4         555            E  3.68  21.0      S23     False      True     False
5         666            F  3.89  22.0      S23     False      True     False
6         777            O  3.91  30.0      F23     False     False      True

In [10]:
duplicates = dt[dt.duplicated()]
duplicates

Empty DataFrame
Columns: [Student ID, Student Name, CGPA, Age, Semester, Gender]
Index: []

In [14]:
dt.head()

   Student ID Student Name  CGPA   Age Semester  Gender
0         111            A  3.22  18.0      F22       1
1         222            B   NaN  20.0      S22       0
2         333            C  3.62   NaN      F23       0
3         444            D  4.00  20.0      F23       1
4         555            E  3.68  21.0      S23       1